[
  {
    "name": "Andhika Maheva Wicaksono",
    "title": "Engineering Manager at Bibit.id",
    "description": "Working closely with Ivan Tanaka has been an absolute pleasure. As a Web Engineer, Ivan consistently showcased exceptional technical expertise and a remarkable ability to tackle complex challenges. His keen eye for detail, coupled with a proactive and collaborative approach, significantly contributed to the success of our web development projects.<br/><br/>Ivan’s dedication to his work is truly admirable. He not only demonstrates a profound understanding of web engineering principles but also remains updated with the latest industry trends, ensuring that our projects are not just functional but cutting-edge.<br/><br/>Ivan’s strong work ethic and excellent communication skills make him a valuable asset to any team. He thrives in a fast-paced environment and consistently delivers results that exceed expectations. I highly recommend Ivan Tanaka for his outstanding contributions as a Web Engineer and am confident that he will excel in any future endeavors."
  },
  {
    "name": "Rizaldi Nur Muhammad",
    "title": "Tukang Koding",
    "description": "Hard work and high dedication in every project."
  },
  {
    "name": "Eka Putra",
    "title": "Sr. Backend Engineer at Bibit.id",
    "description": "Ivan was an excellent front-end developer, We worked together on several projects and he handled his tasks very well, kudos to you Ivan"
  },
  {
    "name": "Hansen Wu",
    "title": "Senior Software Engineer at Pinhome",
    "description": "Ivan has been a close friend of mine for many years, since our middle school days. He's a genuinely kind, intelligent, and fun person.<br/><br/>In professional working, Ivan is a person who has extraordinary maturity, creativity, directness and an objective point of view. He enjoys tackling new challenges and often responds with unique insight, and can explain his ideas effectively."
  },
  {
    "name": "Raditya Danang Dimasaji",
    "title": "Front End Engineer at Bibit.id, Ex-Tokopedia",
    "description": "Ivan was an amazing colleague to work with. He tackled complex product at Bibit and maintain it with ease (Bibit Institution). Despite the hardship of work, Ivan kept reminding us that work can be fun, he always be the one to check up on us with jokes and bonding opportunities. I would recommend Ivan highly for a front-end engineering job."
  }
]
