[
  {
    "corporate": "Central Mega Kencana",
    "position": "IT Developer Specialist",
    "corporate_link": "https://centralmegakencana.com/",
    "start_date": "2024/10",
    "end_date": null,
    "jobs": [
      "Developing and maintaining the e-commerce website using <strong>Next.js, Tailwind CSS,</strong> and <strong>Go</strong> to ensure <strong>scalability and performance</strong>.",
      "Building a reusable design system as an <strong>NPM package</strong> with <strong>React.js</strong> and <strong>Styled Components</strong>, ensuring <strong>consistency and a high-quality user experience</strong> across multiple repositories.",
      "Delivering an engraving activity system for the <i>Frank & Co. x Maudy Ayunda</i> collaboration event within a <strong>tight timeframe</strong>.",
      "Enhancing <strong>SEO performance</strong> by working closely with the marketing team, utilizing <strong>Google Analytics</strong>, sitemaps, and <strong>robots.txt</strong> for <strong>better search visibility</strong>.",
      "Initiated and developed a <strong>multi-brand management system</strong> using <strong>Go and Next.js</strong> to streamline operations across all company brands.",
      "Implemented database migrations with <strong>Goose</strong> ensuring efficient schema versioning and data integrity.",
      "Integrated <strong><i>Qontak by Mekari</i></strong> APIs - A WhatsApp message notification service - using <strong>Go</strong>.",
      "Integrated <strong>CI/CD pipelines</strong> into several projects using tools like <strong>GitHub Actions</strong> and <strong>Docker</strong> to automate testing, streamline deployment, and improve development workflows.",
      "Implemented <strong>HTTP-only cookies</strong> to enhance <strong>security and protect sensitive data</strong> from client-side access."
    ]
  },
  {
    "corporate": "Ayovest",
    "position": "Web Developer Specialist",
    "corporate_link": "https://www.ayovest.id/",
    "start_date": "2023/12",
    "end_date": "2024/10",
    "jobs": [
      "Developed a mutual fund investment application and web using <strong>Next.js</strong> and <strong>Vue.js</strong>.",
      "Acted as the IT representative, coordinating with vendors and stakeholders to <strong>streamline communication</strong>.",
      "Refactored legacy code using <strong>Next.js</strong> for <strong>improved performance and maintainability</strong>.",
      "Collaborated with the UI/UX team in developing the <i>Financial Checkup</i> module.",
      "Initiated documentation using <strong>Notion</strong> for <strong>better knowledge management</strong>.",
      "Started a <strong>Design System</strong> project to ensure <strong>consistency across platforms</strong>.",
      "Implemented <strong>management tools</strong> using <strong>Atlassian</strong> to improve <strong>workflow efficiency</strong>.",
      "Facilitated the company in obtaining a <strong>Virtual Account</strong> by ensuring compliance with <strong>SNAP BI</strong> regulations.",
      "Ensured <strong>OJK compliance</strong> for registration and supervision regulations.",
      "Developed an <strong>email blasting system</strong> using <strong>Google Script</strong> to <strong>streamline customer service operations</strong>."
    ]
  },
  {
    "corporate": "Bibit - Stockbit",
    "position": "Web Engineer",
    "corporate_link": "https://bibit.id/",
    "start_date": "2022/05",
    "end_date": "2023/10",
    "jobs": [
      "Engineered a <strong>mutual fund investment ecosystem</strong> for web and mobile using <strong>React.js</strong>, improving scalability and performance.",
      "Led the development of <i>Bibit Institution</i>, an <strong>investment platform for institutional clients</strong>, expanding market reach.",
      "Designed and implemented a <strong>filter system</strong> for <i>Top Product</i>, enhancing product discoverability and user experience.",
      "Developed an <strong>institutional product webpage</strong> using <strong>Next.js</strong>, optimizing page load speeds and SEO.",
      "Implemented a <strong>stamp duty payment feature</strong> to automate tax compliance for transactions.",
      "Maintained system stability through <strong>daily bug fixes</strong> and <strong>analytics-driven optimizations</strong>."
    ]
  },
  {
    "corporate": "Topremit",
    "position": "Front-End Developer",
    "corporate_link": "https://topremit.com/en",
    "start_date": "2021/01",
    "end_date": "2022/03",
    "jobs": [
      "Developed a <strong>remittance ecosystem</strong> for mobile and web using <strong>React.js, React Native,</strong> and <strong>Next.js</strong>, streamlining cross-border transactions.",
      "Built and optimized the company’s <strong>profile webpage</strong> using <strong>React.js</strong> for better engagement.",
      "Developed <i>Topremit for Business</i>, a <strong>remittance platform for corporate clients</strong>, using <strong>Next.js</strong>.",
      "Implemented an <strong>OTP-based phone verification</strong> system to enhance security for user authentication.",
      "Ensured software reliability with proactive <strong>bug fixes</strong> and continuous optimizations."
    ]
  },
  {
    "corporate": "Bahaso",
    "position": "Mobile Software Developer",
    "corporate_link": "https://bahaso.com/",
    "start_date": "2019/06",
    "end_date": "2020/01",
    "jobs": [
      "Developed <strong>language e-learning applications</strong> using <strong>Flutter</strong>, making learning more accessible.",
      "Applied <strong>MVVM architecture</strong> with <strong>Provider</strong> for efficient state management and better performance.",
      "Built an <strong>Arabic language learning app</strong> using <strong>Flutter</strong>, expanding Bahaso’s course offerings.",
      "Worked in an <strong>Agile team</strong> following <strong>Scrum and Kanban (Scrumban)</strong> methodologies to improve development efficiency."
    ]
  },
  {
    "corporate": "Royal Brewhouse Group",
    "position": "Backend Developer",
    "corporate_link": "https://royalbrewhouseindonesia.com/",
    "start_date": "2018/08",
    "end_date": "2019/04",
    "jobs": [
      "Developed and maintained backend systems using <strong>Laravel</strong>, ensuring smooth business operations.",
      "Designed and optimized <strong>RESTful APIs</strong>, following <strong>MVC architecture</strong> and best database practices.",
      "Built a <strong>marketplace back-office system</strong> to streamline inventory and order management."
    ]
  }
]
